In [1]:
# import libraries
import pandas as pd
import duckdb

# Load and clean data using pandas

In [2]:
# import dataset
cards = pd.read_csv('../dataset/cards_data.csv')
users = pd.read_csv('../dataset/users_data.csv')
transactions = pd.read_csv('../dataset/transactions_data.csv')

## Cards

In [4]:
# show head of cards data
cards.head()

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,4344676511950444,12/2022,623,YES,2,$24295,09/2002,2008,No
1,2731,825,Visa,Debit,4956965974959986,12/2020,393,YES,2,$21968,04/2014,2014,No
2,3701,825,Visa,Debit,4582313478255491,02/2024,719,YES,2,$46414,07/2003,2004,No
3,42,825,Visa,Credit,4879494103069057,08/2024,693,NO,1,$12400,01/2003,2012,No
4,4659,825,Mastercard,Debit (Prepaid),5722874738736011,03/2009,75,YES,1,$28,09/2008,2009,No

In [5]:
# check duplicated 
cards.duplicated().sum()

np.int64(0)

In [6]:
# check missing value
cards.isna().sum()

id                       0
client_id                0
card_brand               0
card_type                0
card_number              0
expires                  0
cvv                      0
has_chip                 0
num_cards_issued         0
credit_limit             0
acct_open_date           0
year_pin_last_changed    0
card_on_dark_web         0
dtype: int64

In [7]:
# remove dolars symbols
cards['credit_limit'] = cards['credit_limit'].str.replace('$', '').astype(int)

In [8]:
# check information of cards data
cards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6146 entries, 0 to 6145
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     6146 non-null   int64
 1   client_id              6146 non-null   int64
 2   card_brand             6146 non-null   object
 3   card_type              6146 non-null   object
 4   card_number            6146 non-null   int64
 5   expires                6146 non-null   object
 6   cvv                    6146 non-null   int64
 7   has_chip               6146 non-null   object
 8   num_cards_issued       6146 non-null   int64
 9   credit_limit           6146 non-null   int64
 10  acct_open_date         6146 non-null   object
 11  year_pin_last_changed  6146 non-null   int64
 12  card_on_dark_web       6146 non-null   object
dtypes: int64(7), object(6)
memory usage: 624.3+ KB

In [9]:
# check value counts of category columns
cat_cols = ['card_brand', 'card_type', 'has_chip','card_on_dark_web']

for col in cat_cols:
  print(cards[col].value_counts(dropna=False))
  print('\n')

card_brand
Mastercard    3209
Visa          2326
Amex           402
Discover       209
Name: count, dtype: int64


card_type
Debit              3511
Credit             2057
Debit (Prepaid)     578
Name: count, dtype: int64


has_chip
YES    5500
NO      646
Name: count, dtype: int64


card_on_dark_web
No    6146
Name: count, dtype: int64

In [10]:
cards.head()

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,4344676511950444,12/2022,623,YES,2,24295,09/2002,2008,No
1,2731,825,Visa,Debit,4956965974959986,12/2020,393,YES,2,21968,04/2014,2014,No
2,3701,825,Visa,Debit,4582313478255491,02/2024,719,YES,2,46414,07/2003,2004,No
3,42,825,Visa,Credit,4879494103069057,08/2024,693,NO,1,12400,01/2003,2012,No
4,4659,825,Mastercard,Debit (Prepaid),5722874738736011,03/2009,75,YES,1,28,09/2008,2009,No

In [11]:
cards.describe().T

,count,mean,std,min,25%,50%,75%,max
id,6146.0,3.072500e+03,1.774342e+03,0.000000e+00,1.536250e+03,3.072500e+03,4.608750e+03,6.145000e+03
client_id,6146.0,9.949396e+02,5.786146e+02,0.000000e+00,4.922500e+02,9.920000e+02,1.495000e+03,1.999000e+03
card_number,6146.0,4.820426e+15,1.328582e+15,3.001055e+14,4.486365e+15,5.108957e+15,5.585237e+15,6.997197e+15
cvv,6146.0,5.062208e+02,2.894311e+02,0.000000e+00,2.570000e+02,5.165000e+02,7.560000e+02,9.990000e+02
num_cards_issued,6146.0,1.503091e+00,5.191909e-01,1.000000e+00,1.000000e+00,1.000000e+00,2.000000e+00,3.000000e+00
credit_limit,6146.0,1.434749e+04,1.201446e+04,0.000000e+00,7.042750e+03,1.259250e+04,1.915650e+04,1.512230e+05
year_pin_last_changed,6146.0,2.013437e+03,4.270699e+00,2.002000e+03,2.010000e+03,2.013000e+03,2.017000e+03,2.020000e+03

## Users

In [12]:
# show head of users data
users.head()

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,825,53,66,1966,11,Female,462 Rose Lane,34.15,-117.76,$29278,$59696,$127613,787,5
1,1746,53,68,1966,12,Female,3606 Federal Boulevard,40.76,-73.74,$37891,$77254,$191349,701,5
2,1718,81,67,1938,11,Female,766 Third Drive,34.02,-117.89,$22681,$33483,$196,698,5
3,708,63,63,1957,1,Female,3 Madison Street,40.71,-73.99,$163145,$249925,$202328,722,4
4,1164,43,70,1976,9,Male,9620 Valley Stream Drive,37.76,-122.44,$53797,$109687,$183855,675,1

In [13]:
# check duplicated value
cards.duplicated().sum()

np.int64(0)

In [14]:
# check missing value
cards.isna().sum()

id                       0
client_id                0
card_brand               0
card_type                0
card_number              0
expires                  0
cvv                      0
has_chip                 0
num_cards_issued         0
credit_limit             0
acct_open_date           0
year_pin_last_changed    0
card_on_dark_web         0
dtype: int64

In [15]:
# remove dolars symbols 
users['per_capita_income'] = users['per_capita_income'].str.replace('$', '').astype(int)
users['yearly_income'] = users['yearly_income'].str.replace('$', '').astype(int)
users['total_debt'] = users['total_debt'].str.replace('$', '').astype(int)

In [16]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 2000 non-null   int64
 1   current_age        2000 non-null   int64
 2   retirement_age     2000 non-null   int64
 3   birth_year         2000 non-null   int64
 4   birth_month        2000 non-null   int64
 5   gender             2000 non-null   object
 6   address            2000 non-null   object
 7   latitude           2000 non-null   float64
 8   longitude          2000 non-null   float64
 9   per_capita_income  2000 non-null   int64
 10  yearly_income      2000 non-null   int64
 11  total_debt         2000 non-null   int64
 12  credit_score       2000 non-null   int64
 13  num_credit_cards   2000 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 218.9+ KB

In [17]:
users.gender.value_counts()

gender
Female    1016
Male       984
Name: count, dtype: int64

In [18]:
users.describe().T.round(2)

,count,mean,std,min,25%,50%,75%,max
id,2000.0,999.50,577.49,0.00,499.75,999.50,1499.25,1999.00
current_age,2000.0,45.39,18.41,18.00,30.00,44.00,58.00,101.00
retirement_age,2000.0,66.24,3.63,50.00,65.00,66.00,68.00,79.00
birth_year,2000.0,1973.80,18.42,1918.00,1961.00,1975.00,1989.00,2002.00
birth_month,2000.0,6.44,3.57,1.00,3.00,7.00,10.00,12.00
latitude,2000.0,37.39,5.11,20.88,33.84,38.25,41.20,61.20
longitude,2000.0,-91.55,16.28,-159.41,-97.40,-86.44,-80.13,-68.67
per_capita_income,2000.0,23141.93,11324.14,0.00,16824.50,20581.00,26286.00,163145.00
yearly_income,2000.0,45715.88,22992.62,1.00,32818.50,40744.50,52698.50,307018.00
total_debt,2000.0,63709.69,52254.45,0.00,23986.75,58251.00,89070.50,516263.00
credit_score,2000.0,709.73,67.22,480.00,681.00,711.50,753.00,850.00
num_credit_cards,2000.0,3.07,1.64,1.00,2.00,3.00,4.00,9.00

## Transactions

In [19]:
transactions.head()

,id,date,client_id,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,zip,mcc,errors
0,7475327,2010-01-01 00:01:00,1556,2972,$-77.00,Swipe Transaction,59935,Beulah,ND,58523.0,5499,NaN
1,7475328,2010-01-01 00:02:00,561,4575,$14.57,Swipe Transaction,67570,Bettendorf,IA,52722.0,5311,NaN
2,7475329,2010-01-01 00:02:00,1129,102,$80.00,Swipe Transaction,27092,Vista,CA,92084.0,4829,NaN
3,7475331,2010-01-01 00:05:00,430,2860,$200.00,Swipe Transaction,27092,Crown Point,IN,46307.0,4829,NaN
4,7475332,2010-01-01 00:06:00,848,3915,$46.41,Swipe Transaction,13051,Harwood,MD,20776.0,5813,NaN

In [20]:
# check shape of data
transactions.shape

(13305915, 12)

In [21]:
# check duplicated value
transactions.duplicated().sum()

np.int64(0)

In [22]:
# check missing value
transactions.isna().sum()

id                       0
date                     0
client_id                0
card_id                  0
amount                   0
use_chip                 0
merchant_id              0
merchant_city            0
merchant_state     1563700
zip                1652706
mcc                      0
errors            13094522
dtype: int64

In [23]:
# remove dolars symbol and change data type to float
transactions['amount'] = transactions['amount'].str.replace('$', '').astype(float)

In [24]:
# change data type of date
transactions['date'] = pd.to_datetime(transactions['date'])

In [25]:
# change data type of zip to integer
transactions['zip'] = transactions['zip'].astype("Int64")

In [26]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13305915 entries, 0 to 13305914
Data columns (total 12 columns):
 #   Column          Dtype
---  ------          -----
 0   id              int64
 1   date            datetime64[ns]
 2   client_id       int64
 3   card_id         int64
 4   amount          float64
 5   use_chip        object
 6   merchant_id     int64
 7   merchant_city   object
 8   merchant_state  object
 9   zip             Int64
 10  mcc             int64
 11  errors          object
dtypes: Int64(1), datetime64[ns](1), float64(1), int64(5), object(4)
memory usage: 1.2+ GB

In [27]:
transactions.dtypes

id                         int64
date              datetime64[ns]
client_id                  int64
card_id                    int64
amount                   float64
use_chip                  object
merchant_id                int64
merchant_city             object
merchant_state            object
zip                        Int64
mcc                        int64
errors                    object
dtype: object

In [28]:
for col in ['merchant_state' , 'use_chip', 'merchant_city', 'merchant_state']:
  print(transactions[col].value_counts(dropna=False))
  print('\n')

merchant_state
NaN           1563700
CA            1427087
TX            1010207
NY             857510
FL             701623
               ...
Ethiopia            3
Suriname            3
Gabon               3
Tonga               2
Azerbaijan          2
Name: count, Length: 200, dtype: int64


use_chip
Swipe Transaction     6967185
Chip Transaction      4780818
Online Transaction    1557912
Name: count, dtype: int64


merchant_city
ONLINE           1563700
Houston           146917
Miami              87388
Brooklyn           84020
Los Angeles        82004
                  ...
Burnett                1
Weaubleau              1
Slemp                  1
Cornettsville          1
London Mills           1
Name: count, Length: 12492, dtype: int64


merchant_state
NaN           1563700
CA            1427087
TX            1010207
NY             857510
FL             701623
               ...
Ethiopia            3
Suriname            3
Gabon               3
Tonga               2
Azerbaijan          2
Name: count, Length: 200, dtype: int64

In [29]:
transactions.head()

,id,date,client_id,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,zip,mcc,errors
0,7475327,2010-01-01 00:01:00,1556,2972,-77.00,Swipe Transaction,59935,Beulah,ND,58523,5499,NaN
1,7475328,2010-01-01 00:02:00,561,4575,14.57,Swipe Transaction,67570,Bettendorf,IA,52722,5311,NaN
2,7475329,2010-01-01 00:02:00,1129,102,80.00,Swipe Transaction,27092,Vista,CA,92084,4829,NaN
3,7475331,2010-01-01 00:05:00,430,2860,200.00,Swipe Transaction,27092,Crown Point,IN,46307,4829,NaN
4,7475332,2010-01-01 00:06:00,848,3915,46.41,Swipe Transaction,13051,Harwood,MD,20776,5813,NaN

In [30]:
transactions.describe().T

,count,mean,min,25%,50%,75%,max,std
id,13305915.0,15584024.565584,7475327.0,11506044.5,15570866.0,19653605.5,23761874.0,4704498.649443
date,13305915,2015-01-06 06:50:27.604354816,2010-01-01 00:01:00,2012-08-08 21:43:00,2015-01-22 12:17:00,2017-06-13 17:45:00,2019-10-31 23:59:00,NaN
client_id,13305915.0,1026.812046,0.0,519.0,1070.0,1531.0,1998.0,581.638559
card_id,13305915.0,3475.267651,0.0,2413.0,3584.0,4901.0,6144.0,1674.355912
amount,13305915.0,42.976039,-500.0,8.93,28.99,63.71,6820.2,81.655748
merchant_id,13305915.0,47723.763181,1.0,25887.0,45926.0,67570.0,100342.0,25815.337691
zip,11653209.0,51327.819831,1001.0,28602.0,47670.0,77901.0,99928.0,29404.225234
mcc,13305915.0,5565.439815,1711.0,5300.0,5499.0,5812.0,9402.0,875.700238

# SQL Analysis using Duckdb

### Users

#### User Count by Gender

In [57]:
duckdb.sql('''
select
  gender,
  count(id) as user_count
from 
  users
group by gender
''')

┌─────────┬────────────┐
│ gender  │ user_count │
│ varchar │   int64    │
├─────────┼────────────┤
│ Female  │       1016 │
│ Male    │        984 │
└─────────┴────────────┘

#### User Count by Age Group

In [58]:
duckdb.sql('''
select 
  case 
    when current_age between 0 and 16 then '0-16'
    when current_age between 17 and 24 then '17-24'
    when current_age between 25 and 34 then '25-34'
    when current_age between 35 and 44 then '35-44'
    when current_age between 45 and 54 then '45-54'
    when current_age > 54 then '55+'
  end as age_category,
  count(id) as user_count
from 
  users 
group by 1
order by 1
''')

┌──────────────┬────────────┐
│ age_category │ user_count │
│   varchar    │   int64    │
├──────────────┼────────────┤
│ 17-24        │        303 │
│ 25-34        │        359 │
│ 35-44        │        349 │
│ 45-54        │        385 │
│ 55+          │        604 │
└──────────────┴────────────┘

#### Credit Score Distribution

In [59]:
duckdb.sql('''
select 
  case 
    when credit_score between 300 and 579 then 'poor' 
    when credit_score between 580 and 669 then 'fair' 
    when credit_score between 670 and 739 then 'good' 
    when credit_score between 740 and 799 then 'very good' 
    when credit_score between 800 and 850 then 'exceptional'
    else 'others'
  end as credit_score_category,
  count(id) as user_count
from 
    users
group by 1 
order by 2 desc
''')

┌───────────────────────┬────────────┐
│ credit_score_category │ user_count │
│        varchar        │   int64    │
├───────────────────────┼────────────┤
│ good                  │        931 │
│ very good             │        474 │
│ fair                  │        348 │
│ exceptional           │        166 │
│ poor                  │         81 │
└───────────────────────┴────────────┘

#### User Geographic Distribution

In [60]:
duckdb.sql('''
select 
  id, 
  address,
  concat(latitude, ', ', longitude) as location,
  per_capita_income,
  yearly_income,
  total_debt, 
  credit_score
from 
  users
''')

┌───────┬──────────────────────────┬────────────────┬───────────────────┬───────────────┬────────────┬──────────────┐
│  id   │         address          │    location    │ per_capita_income │ yearly_income │ total_debt │ credit_score │
│ int64 │         varchar          │    varchar     │       int64       │     int64     │   int64    │    int64     │
├───────┼──────────────────────────┼────────────────┼───────────────────┼───────────────┼────────────┼──────────────┤
│   825 │ 462 Rose Lane            │ 34.15, -117.76 │             29278 │         59696 │     127613 │          787 │
│  1746 │ 3606 Federal Boulevard   │ 40.76, -73.74  │             37891 │         77254 │     191349 │          701 │
│  1718 │ 766 Third Drive          │ 34.02, -117.89 │             22681 │         33483 │        196 │          698 │
│   708 │ 3 Madison Street         │ 40.71, -73.99  │            163145 │        249925 │     202328 │          722 │
│  1164 │ 9620 Valley Stream Drive │ 37.76, -122.44 │             53797 │        109687 │     183855 │          675 │
│    68 │ 58 Birch Lane            │ 41.55, -90.6   │             20599 │         41997 │          0 │          704 │
│  1075 │ 5695 Fifth Street        │ 38.22, -85.74  │             25258 │         51500 │     102286 │          672 │
│  1711 │ 1941 Ninth Street        │ 45.51, -122.64 │             26790 │         54623 │     114711 │          728 │
│  1116 │ 11 Spruce Avenue         │ 40.32, -75.32  │             26273 │         42509 │       2895 │          755 │
│  1752 │ 887 Grant Street         │ 29.97, -92.12  │             18730 │         38190 │      81262 │          810 │
│    ·  │        ·                 │       ·        │               ·   │           ·   │        ·   │           ·  │
│    ·  │        ·                 │       ·        │               ·   │           ·   │        ·   │           ·  │
│    ·  │        ·                 │       ·        │               ·   │           ·   │        ·   │           ·  │
│   932 │ 295 West Avenue          │ 32.36, -92.97  │             16760 │         34172 │      71366 │          811 │
│   378 │ 512 Second Avenue        │ 46.21, -119.16 │             18753 │         38241 │      81833 │          596 │
│   647 │ 27 Birch Avenue          │ 36.52, -119.39 │             13194 │         26900 │      74083 │          758 │
│   391 │ 31 Hill Boulevard        │ 33.69, -78.89  │             19025 │         35270 │       1769 │          731 │
│   588 │ 2183 Catherine Boulevard │ 38.47, -90.75  │             23106 │         47109 │      76035 │          844 │
│   986 │ 6577 Lexington Lane      │ 40.65, -73.58  │             23550 │         48010 │      87837 │          703 │
│  1944 │ 2 Elm Drive              │ 38.95, -84.54  │             24218 │         49378 │     104480 │          740 │
│   185 │ 276 Fifth Boulevard      │ 40.66, -74.19  │             15175 │         30942 │      71066 │          779 │
│  1007 │ 259 Valley Boulevard     │ 40.24, -76.92  │             25336 │         54654 │      27241 │          618 │
│  1110 │ 472 Ocean View Street    │ 42.86, -71.48  │             32325 │         65909 │     181261 │          673 │
├───────┴──────────────────────────┴────────────────┴───────────────────┴───────────────┴────────────┴──────────────┤
│ 2000 rows (20 shown)                                                                                    7 columns │
└───────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘

### Cards

#### Card brand by card type

In [61]:
duckdb.sql('''
select
  card_type,
  string_agg(distinct card_brand, ', ' order by card_brand) AS brands_in_type
from cards
group by card_type
order by card_type;
''')

┌─────────────────┬──────────────────────────────────┐
│    card_type    │          brands_in_type          │
│     varchar     │             varchar              │
├─────────────────┼──────────────────────────────────┤
│ Credit          │ Amex, Discover, Mastercard, Visa │
│ Debit           │ Mastercard, Visa                 │
│ Debit (Prepaid) │ Mastercard, Visa                 │
└─────────────────┴──────────────────────────────────┘

#### Card Count by Card Type

In [62]:
duckdb.sql('''
select 
  card_type,
  count(id) as count_card
from 
  cards 
group by card_type
order by 2 desc
''')

┌─────────────────┬────────────┐
│    card_type    │ count_card │
│     varchar     │   int64    │
├─────────────────┼────────────┤
│ Debit           │       3511 │
│ Credit          │       2057 │
│ Debit (Prepaid) │        578 │
└─────────────────┴────────────┘

#### Card Count by Card Type and card brand

In [63]:
duckdb.sql('''
select
  card_type,
  card_brand,
  COUNT(*) AS card_count, 
  round(avg(credit_limit), 2) as avg_credit_limit
from cards
group by card_type, card_brand
order by card_type, card_count desc, card_brand
''')

┌─────────────────┬────────────┬────────────┬──────────────────┐
│    card_type    │ card_brand │ card_count │ avg_credit_limit │
│     varchar     │  varchar   │   int64    │      double      │
├─────────────────┼────────────┼────────────┼──────────────────┤
│ Credit          │ Visa       │        811 │         11295.56 │
│ Credit          │ Mastercard │        635 │         10971.65 │
│ Credit          │ Amex       │        402 │         11436.32 │
│ Credit          │ Discover   │        209 │         10816.27 │
│ Debit           │ Mastercard │       2191 │         18279.71 │
│ Debit           │ Visa       │       1320 │         19019.62 │
│ Debit (Prepaid) │ Mastercard │        383 │            64.78 │
│ Debit (Prepaid) │ Visa       │        195 │             63.8 │
└─────────────────┴────────────┴────────────┴──────────────────┘

### Transactions

#### Transaction Count and Total Amount by Use Chip

In [64]:
duckdb.sql('''
select 
  use_chip,
  count(id) as count_transaction,
  round(sum(amount),2) as total_amount
from 
  transactions
group by use_chip
order by 2 desc
''')

┌────────────────────┬───────────────────┬──────────────┐
│      use_chip      │ count_transaction │ total_amount │
│      varchar       │       int64       │    double    │
├────────────────────┼───────────────────┼──────────────┤
│ Swipe Transaction  │           6967185 │ 287151828.83 │
│ Chip Transaction   │           4780818 │ 195483583.94 │
│ Online Transaction │           1557912 │  89200109.51 │
└────────────────────┴───────────────────┴──────────────┘

#### Top 10 MCC by Transaction Count

In [65]:
duckdb.sql('''
select 
  mcc,
  count(*) as count_transactions
from 
  transactions 
group by mcc
order by 2 desc
limit 10 
''')

┌───────┬────────────────────┐
│  mcc  │ count_transactions │
│ int64 │       int64        │
├───────┼────────────────────┤
│  5411 │            1592584 │
│  5499 │            1460875 │
│  5541 │            1424711 │
│  5812 │             999738 │
│  5912 │             772913 │
│  4784 │             674135 │
│  5300 │             601942 │
│  4829 │             589140 │
│  4121 │             500662 │
│  5814 │             499659 │
├───────┴────────────────────┤
│ 10 rows          2 columns │
└────────────────────────────┘

#### Top 10 MCC by Total Amount

In [66]:
duckdb.sql('''
select 
  mcc,
  round(sum(amount),2) as total_amount
from 
  transactions 
group by mcc
order by 2 desc
limit 10 
''')

┌───────┬──────────────┐
│  mcc  │ total_amount │
│ int64 │    double    │
├───────┼──────────────┤
│  4829 │  53158515.64 │
│  5411 │  40970754.15 │
│  5300 │  37697546.74 │
│  5912 │  35113527.69 │
│  5541 │  29570426.66 │
│  4900 │  27650038.08 │
│  5311 │   27031968.7 │
│  5812 │  26348225.47 │
│  7538 │  24955640.73 │
│  4814 │  24726472.83 │
├───────┴──────────────┤
│ 10 rows    2 columns │
└──────────────────────┘

#### Transaction Count and Total Amount by Card Type and Channel Use Chip

In [67]:
duckdb.sql('''
select 
  c.card_type,
  t.use_chip,
  count(t.id) as count_transaction,
  round(sum(t.amount),2) as total_amount
from 
  transactions t 
left join
  cards c on t.card_id = c.id
group by c.card_type, t.use_chip
order by c.card_type, t.use_chip
''')

┌─────────────────┬────────────────────┬───────────────────┬──────────────┐
│    card_type    │      use_chip      │ count_transaction │ total_amount │
│     varchar     │      varchar       │       int64       │    double    │
├─────────────────┼────────────────────┼───────────────────┼──────────────┤
│ Credit          │ Chip Transaction   │           1469446 │  76829297.94 │
│ Credit          │ Online Transaction │            468104 │  34764689.08 │
│ Credit          │ Swipe Transaction  │           2171639 │ 114217832.99 │
│ Debit           │ Chip Transaction   │           2987404 │ 111968279.35 │
│ Debit           │ Online Transaction │            970789 │  50822937.02 │
│ Debit           │ Swipe Transaction  │           4322803 │ 163300282.01 │
│ Debit (Prepaid) │ Chip Transaction   │            323968 │   6686006.65 │
│ Debit (Prepaid) │ Online Transaction │            119019 │   3612483.41 │
│ Debit (Prepaid) │ Swipe Transaction  │            472743 │   9633713.83 │
└─────────────────┴────────────────────┴───────────────────┴──────────────┘

#### Transaction by Gender, Card Type, and Use Chip

In [68]:
duckdb.sql('''
select 
  u.gender,
  c.card_type,
  t.use_chip,
  count(t.id) as count_transaction,
  round(sum(t.amount),2) as total_amount
from 
  transactions t 
left join
  cards c on t.card_id = c.id
left join
  users u on t.client_id = u.id
group by u.gender, c.card_type, t.use_chip
order by u.gender, c.card_type, t.use_chip
''')

┌─────────┬─────────────────┬────────────────────┬───────────────────┬──────────────┐
│ gender  │    card_type    │      use_chip      │ count_transaction │ total_amount │
│ varchar │     varchar     │      varchar       │       int64       │    double    │
├─────────┼─────────────────┼────────────────────┼───────────────────┼──────────────┤
│ Female  │ Credit          │ Chip Transaction   │            754735 │   39653368.0 │
│ Female  │ Credit          │ Online Transaction │            254594 │  18212306.56 │
│ Female  │ Credit          │ Swipe Transaction  │           1097538 │  57216269.33 │
│ Female  │ Debit           │ Chip Transaction   │           1546981 │  58815742.89 │
│ Female  │ Debit           │ Online Transaction │            504916 │  26318822.76 │
│ Female  │ Debit           │ Swipe Transaction  │           2187565 │  83417811.96 │
│ Female  │ Debit (Prepaid) │ Chip Transaction   │            171021 │   3321789.81 │
│ Female  │ Debit (Prepaid) │ Online Transaction │             59752 │   1712088.08 │
│ Female  │ Debit (Prepaid) │ Swipe Transaction  │            238814 │   4641345.91 │
│ Male    │ Credit          │ Chip Transaction   │            714711 │  37175929.94 │
│ Male    │ Credit          │ Online Transaction │            213510 │  16552382.52 │
│ Male    │ Credit          │ Swipe Transaction  │           1074101 │  57001563.66 │
│ Male    │ Debit           │ Chip Transaction   │           1440423 │  53152536.46 │
│ Male    │ Debit           │ Online Transaction │            465873 │  24504114.26 │
│ Male    │ Debit           │ Swipe Transaction  │           2135238 │  79882470.05 │
│ Male    │ Debit (Prepaid) │ Chip Transaction   │            152947 │   3364216.84 │
│ Male    │ Debit (Prepaid) │ Online Transaction │             59267 │   1900395.33 │
│ Male    │ Debit (Prepaid) │ Swipe Transaction  │            233929 │   4992367.92 │
├─────────┴─────────────────┴────────────────────┴───────────────────┴──────────────┤
│ 18 rows                                                                 5 columns │
└───────────────────────────────────────────────────────────────────────────────────┘

#### Transaction Count and Total Amount by Card Type × Brand

In [74]:
duckdb.sql('''
select 
  c.card_type,
  c.card_brand,
  count(t.id) as count_transaction,
  round(sum(t.amount),2) as total_amount
from 
  transactions t 
left join
  cards c on t.card_id = c.id
group by c.card_type, c.card_brand
order by c.card_type, count(t.id) desc
''')

┌─────────────────┬────────────┬───────────────────┬──────────────┐
│    card_type    │ card_brand │ count_transaction │ total_amount │
│     varchar     │  varchar   │       int64       │    double    │
├─────────────────┼────────────┼───────────────────┼──────────────┤
│ Credit          │ Visa       │           1660478 │  93918588.14 │
│ Credit          │ Mastercard │           1257758 │  66551690.94 │
│ Credit          │ Amex       │            854490 │   46943539.4 │
│ Credit          │ Discover   │            336463 │  18398001.53 │
│ Debit           │ Mastercard │           5266960 │ 207445330.42 │
│ Debit           │ Visa       │           3014036 │ 118646167.96 │
│ Debit (Prepaid) │ Mastercard │            632681 │  13928007.52 │
│ Debit (Prepaid) │ Visa       │            283049 │   6004196.37 │
└─────────────────┴────────────┴───────────────────┴──────────────┘

#### Transaction Count and Total Amount by Gender × Card Type

In [70]:
duckdb.sql('''
select 
  u.gender,
  c.card_type,
  count(t.id) as count_transaction,
  round(sum(t.amount),2) as total_amount
from 
  transactions t
left join 
  users u on t.client_id = u.id
left join 
  cards c on t.card_id = c.id
group by u.gender, c.card_type
order by u.gender, c.card_type
''')

┌─────────┬─────────────────┬───────────────────┬──────────────┐
│ gender  │    card_type    │ count_transaction │ total_amount │
│ varchar │     varchar     │       int64       │    double    │
├─────────┼─────────────────┼───────────────────┼──────────────┤
│ Female  │ Credit          │           2106867 │ 115081943.89 │
│ Female  │ Debit           │           4239462 │ 168552377.61 │
│ Female  │ Debit (Prepaid) │            469587 │    9675223.8 │
│ Male    │ Credit          │           2002322 │ 110729876.12 │
│ Male    │ Debit           │           4041534 │ 157539120.77 │
│ Male    │ Debit (Prepaid) │            446143 │  10256980.09 │
└─────────┴─────────────────┴───────────────────┴──────────────┘

#### Users Without Transactions" / Inactive Users

In [71]:
duckdb.sql('''
select 
   count(u.id) as inactive_user
from 
  users u 
left join 
  transactions t on u.id = t.client_id
where t.client_id is null
''')

┌───────────────┐
│ inactive_user │
│     int64     │
├───────────────┤
│           781 │
└───────────────┘

In [72]:
duckdb.sql('''
select 
   u.*
from 
  users u 
left join 
  transactions t on u.id = t.client_id
where t.client_id is null
''')

┌───────┬─────────────┬────────────────┬────────────┬─────────────┬─────────┬────────────────────────┬──────────┬───────────┬───────────────────┬───────────────┬────────────┬──────────────┬──────────────────┐
│  id   │ current_age │ retirement_age │ birth_year │ birth_month │ gender  │        address         │ latitude │ longitude │ per_capita_income │ yearly_income │ total_debt │ credit_score │ num_credit_cards │
│ int64 │    int64    │     int64      │   int64    │    int64    │ varchar │        varchar         │  double  │  double   │       int64       │     int64     │   int64    │    int64     │      int64       │
├───────┼─────────────┼────────────────┼────────────┼─────────────┼─────────┼────────────────────────┼──────────┼───────────┼───────────────────┼───────────────┼────────────┼──────────────┼──────────────────┤
│  1231 │          26 │             52 │       1994 │           1 │ Female  │ 613 Little Creek Lane  │    26.41 │    -81.42 │             10819 │         22066 │      38967 │          842 │                1 │
│   307 │          18 │             69 │       2001 │           8 │ Male    │ 2846 Lake Avenue       │    30.23 │    -92.81 │             18082 │         36866 │          0 │          680 │                2 │
│  1968 │          25 │             69 │       1994 │          11 │ Female  │ 611 Elm Lane           │    40.94 │    -73.86 │             31299 │         63816 │     100128 │          775 │                1 │
│  1734 │          37 │             69 │       1982 │          11 │ Male    │ 185 Forest Drive       │    33.95 │    -84.54 │             40530 │         82637 │      84762 │          739 │                2 │
│  1033 │          18 │             58 │       2002 │           2 │ Female  │ 352 George Street      │    43.07 │    -82.49 │             16598 │         33844 │      42109 │          684 │                2 │
│   298 │          28 │             65 │       1991 │           5 │ Male    │ 437 Ocean View Drive   │    40.79 │    -77.85 │             25031 │         51041 │     106989 │          686 │                1 │
│  1199 │          29 │             68 │       1990 │           6 │ Male    │ 704 Eighth Avenue      │    42.93 │    -75.38 │             19161 │         39069 │      63884 │          720 │                2 │
│  1191 │          25 │             69 │       1994 │          12 │ Female  │ 299 Oak Boulevard      │    45.19 │   -123.24 │             18098 │         36902 │      60538 │          711 │                1 │
│   925 │          31 │             68 │       1988 │           3 │ Male    │ 4165 Valley Avenue     │    38.76 │    -89.97 │             28710 │         58538 │      93153 │          610 │                1 │
│   824 │          32 │             66 │       1987 │           8 │ Female  │ 38 Catherine Boulevard │    27.75 │    -82.64 │             18100 │         36901 │      23293 │          695 │                4 │
│    ·  │           · │              · │         ·  │           · │   ·     │         ·              │       ·  │       ·   │               ·   │           ·   │        ·   │           ·  │                · │
│    ·  │           · │              · │         ·  │           · │   ·     │         ·              │       ·  │       ·   │               ·   │           ·   │        ·   │           ·  │                · │
│    ·  │           · │              · │         ·  │           · │   ·     │         ·              │       ·  │       ·   │               ·   │           ·   │        ·   │           ·  │                · │
│  1410 │          22 │             63 │       1998 │           1 │ Female  │ 7902 Norfolk Drive     │     39.3 │    -76.44 │             21017 │         42856 │      67954 │          571 │                1 │
│     6 │          19 │             63 │       2000 │           6 │ Female  │ 534 Second Lane        │    32.88 │   -117.13 │             27394 │         55854 │     111042 │          782 │                1 │
│  1681 │          21 │             72 │       1998 │           6 │ Male    │ 21 Birch Drive         │    38.63 │    -90.24 │             31909 │         65058 │     157708 │          746 │                1 │
│   624 │          33 │             66 │       1987 │           2 │ Male    │ 515 Spruce Boulevard   │    42.89 │    -85.72 │             18431 │         37579 │      59201 │          710 │                2 │
│   809 │          54 │             66 │       1965 │           5 │ Female  │ 2855 Sixth Avenue      │    41.76 │    -88.15 │             41979 │         85596 │     159101 │          618 │                1 │
│   105 │          54 │             68 │       1965 │           8 │ Male    │ 420 Oak Drive          │    41.47 │    -75.57 │             18432 │         37579 │          0 │          742 │                5 │
│   499 │          23 │             66 │       1996 │           9 │ Male    │ 8373 Birch Boulevard   │    40.71 │    -73.99 │             18525 │         37769 │       1412 │          742 │                2 │
│  1947 │          87 │             66 │       1932 │           4 │ Male    │ 770 Maple Street       │    31.62 │    -82.88 │             14060 │         27971 │       1265 │          765 │                4 │
│  1545 │          20 │             63 │       1999 │          12 │ Male    │ 1433 Rose Boulevard    │    33.73 │   -117.05 │             15144 │         30882 │      60484 │          807 │                3 │
│   420 │          22 │             62 │       1998 │           2 │ Male    │ 1651 Oak Drive         │    33.82 │   -117.91 │             16252 │         33140 │      51305 │          744 │                1 │
├───────┴─────────────┴────────────────┴────────────┴─────────────┴─────────┴────────────────────────┴──────────┴───────────┴───────────────────┴───────────────┴────────────┴──────────────┴──────────────────┤
│ 781 rows (20 shown)                                                                                                                                                                               14 columns │
└──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘

## Save data for dashboard

In [73]:
data = duckdb.sql('''
select
  t.client_id,
  u.yearly_income,
  u.gender,         
  concat(u.latitude, ', ', u.longitude) as location,
  case 
    when u.current_age between 0 and 16 then '0-16'
    when u.current_age between 17 and 24 then '17-24'
    when u.current_age between 25 and 34 then '25-34'
    when u.current_age between 35 and 44 then '35-44'
    when u.current_age between 45 and 54 then '45-54'
    when u.current_age > 54 then '55+'
  end as age_category,
  case 
    when u.credit_score between 300 and 579 then 'poor' 
    when u.credit_score between 580 and 669 then 'fair' 
    when u.credit_score between 670 and 739 then 'good' 
    when u.credit_score between 740 and 799 then 'very good' 
    when u.credit_score between 800 and 850 then 'exceptional'
    else 'others'
  end as credit_score_category,
  u.total_debt,
  u.yearly_income,
  c.card_type,
  c.card_brand,
  t.mcc,
  t.use_chip,
  count(t.id) as count_transaction,
  round(sum(t.amount),2) as total_amount
from 
  transactions t
left join 
  users u on t.client_id = u.id
left join 
  cards c on t.card_id = c.id
group by 1,2,3,4,5,6,7,8,9,10,11,12
order by age_category
''')

data.to_csv('data/data-dashboard.csv')

FloatProgress(value=0.0, layout=Layout(width='auto'), style=ProgressStyle(bar_color='black'))